7767517
102 118
Input            in                       0 1 in
Convolution      175                      1 1 in 175 0=24 1=7 11=7 2=1 12=1 3=4 13=4 4=3 14=3 5=1 6=3528
Split            splitncnn_0              1 2 175 175_splitncnn_0 175_splitncnn_1
UnaryOp          177                      1 1 175_splitncnn_1 177 0=1
Concat           178                      2 1 175_splitncnn_0 177 178 0=0
ReLU             179                      1 1 178 179
Pooling          180                      1 1 179 180 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Convolution      181                      1 1 180 181 0=64 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 5=1 6=76800
Split            splitncnn_1              1 2 181 181_splitncnn_0 181_splitncnn_1
UnaryOp          183                      1 1 181_splitncnn_1 183 0=1
Concat           184                      2 1 181_splitncnn_0 183 184 0=0
ReLU             185                      1 1 184 185
Pooling          186                      1 1 185 186 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_2              1 4 186 186_splitncnn_0 186_splitncnn_1 186_splitncnn_2 186_splitncnn_3
Convolution      187                      1 1 186_splitncnn_3 187 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
ReLU             189                      1 1 187 189
Padding          190                      1 1 186_splitncnn_2 190 0=1 1=1 2=1 3=1 4=0 5=0.000000
Pooling          191                      1 1 190 191 0=1 1=3 11=3 2=1 12=1 3=0 13=0 14=0 15=0 5=1
Convolution      192                      1 1 191 192 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
ReLU             194                      1 1 192 194
Convolution      195                      1 1 186_splitncnn_1 195 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3072
ReLU             197                      1 1 195 197
Convolution      198                      1 1 197 198 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=6912
ReLU             200                      1 1 198 200
Convolution      201                      1 1 186_splitncnn_0 201 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3072
ReLU             203                      1 1 201 203
Convolution      204                      1 1 203 204 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=6912
ReLU             206                      1 1 204 206
Convolution      207                      1 1 206 207 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=9216
ReLU             209                      1 1 207 209
Concat           210                      4 1 189 194 200 209 210 0=0
Split            splitncnn_3              1 4 210 210_splitncnn_0 210_splitncnn_1 210_splitncnn_2 210_splitncnn_3
Convolution      211                      1 1 210_splitncnn_3 211 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
ReLU             213                      1 1 211 213
Padding          214                      1 1 210_splitncnn_2 214 0=1 1=1 2=1 3=1 4=0 5=0.000000
Pooling          215                      1 1 214 215 0=1 1=3 11=3 2=1 12=1 3=0 13=0 14=0 15=0 5=1
Convolution      216                      1 1 215 216 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
ReLU             218                      1 1 216 218
Convolution      219                      1 1 210_splitncnn_1 219 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3072
ReLU             221                      1 1 219 221
Convolution      222                      1 1 221 222 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=6912
ReLU             224                      1 1 222 224
Convolution      225                      1 1 210_splitncnn_0 225 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3072
ReLU             227                      1 1 225 227
Convolution      228                      1 1 227 228 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=6912
ReLU             230                      1 1 228 230
Convolution      231                      1 1 230 231 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=9216
ReLU             233                      1 1 231 233
Concat           234                      4 1 213 218 224 233 234 0=0
Split            splitncnn_4              1 4 234 234_splitncnn_0 234_splitncnn_1 234_splitncnn_2 234_splitncnn_3
Convolution      235                      1 1 234_splitncnn_3 235 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
ReLU             237                      1 1 235 237
Padding          238                      1 1 234_splitncnn_2 238 0=1 1=1 2=1 3=1 4=0 5=0.000000
Pooling          239                      1 1 238 239 0=1 1=3 11=3 2=1 12=1 3=0 13=0 14=0 15=0 5=1
Convolution      240                      1 1 239 240 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
ReLU             242                      1 1 240 242
Convolution      243                      1 1 234_splitncnn_1 243 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3072
ReLU             245                      1 1 243 245
Convolution      246                      1 1 245 246 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=6912
ReLU             248                      1 1 246 248
Convolution      249                      1 1 234_splitncnn_0 249 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3072
ReLU             251                      1 1 249 251
Convolution      252                      1 1 251 252 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=6912
ReLU             254                      1 1 252 254
Convolution      255                      1 1 254 255 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=9216
ReLU             257                      1 1 255 257
Concat           258                      4 1 237 242 248 257 258 0=0
Split            splitncnn_5              1 3 258 258_splitncnn_0 258_splitncnn_1 258_splitncnn_2
Convolution      259                      1 1 258_splitncnn_2 259 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=16384
ReLU             261                      1 1 259 261
Convolution      262                      1 1 261 262 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=294912
ReLU             264                      1 1 262 264
Split            splitncnn_6              1 3 264 264_splitncnn_0 264_splitncnn_1 264_splitncnn_2
Convolution      265                      1 1 264_splitncnn_2 265 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=32768
ReLU             267                      1 1 265 267
Convolution      268                      1 1 267 268 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=294912
ReLU             270                      1 1 268 270
Split            splitncnn_7              1 2 270 270_splitncnn_0 270_splitncnn_1
Convolution      271                      1 1 258_splitncnn_1 271 0=84 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=96768
Permute          272                      1 1 271 272 0=3
Convolution      273                      1 1 258_splitncnn_0 273 0=42 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=48384
Permute          274                      1 1 273 274 0=3
Convolution      275                      1 1 264_splitncnn_1 275 0=4 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=9216
Permute          276                      1 1 275 276 0=3
Convolution      277                      1 1 264_splitncnn_0 277 0=2 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=4608
Permute          278                      1 1 277 278 0=3
Convolution      279                      1 1 270_splitncnn_1 279 0=4 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=9216
Permute          280                      1 1 279 280 0=3
Convolution      281                      1 1 270_splitncnn_0 281 0=2 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=4608
Permute          282                      1 1 281 282 0=3
Reshape          290                      1 1 272 290 0=-1
Reshape          298                      1 1 276 298 0=-1
Reshape          306                      1 1 280 306 0=-1
Concat           307                      3 1 290 298 306 307 0=0
Reshape          315                      1 1 274 315 0=-1
Reshape          323                      1 1 278 323 0=-1
Reshape          331                      1 1 282 331 0=-1
Concat           332                      3 1 315 323 331 332 0=0
Reshape          342                      1 1 307 342 0=4 1=-1
Reshape          352                      1 1 332 352 0=2 1=-1
Softmax          353                      1 1 352 353 0=1 1=1
Concat           out                      2 1 342 353 out 0=1
